# ReverseIterator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DoubleArray..::..ReverseIterator Method
DoubleArray Class See Also
---
Retrieve a backward moving iterator to the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual DoubleArrayIterator ReverseIterator()
```

Visual Basic
---
```text
Public Overridable Function ReverseIterator As DoubleArrayIterator
```

Visual C++
---
```text
public:
virtual DoubleArrayIterator^ ReverseIterator()
```

# ### Return Value
Returns a backward moving iterator to the array.
# See Also
DoubleArray Class
Autodesk.Revit.DB Namespace